Revit 2027 API
BuiltInFailures.StairRampFailures.OnlyMonolithicStairs Property
 Tread thickness can't be zero for non-monolithic stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OnlyMonolithicStairs { get; }
Public Shared ReadOnly Property OnlyMonolithicStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OnlyMonolithicStairs {
	FailureDefinitionId^ get ();
}
static member OnlyMonolithicStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace